ayudantias/asociaciones/app/views/albums/show.html.erb

  <tbody>
    <% @album.songs.each do |song| %>
---
SELECT "songs".* FROM "songs" WHERE "songs"."album_id" = $1  [["album_id", 3]]