ayudantias/asociaciones/app/views/playlists/show.html.erb

SELECT "songs".* FROM "songs" INNER JOIN "playlists_songs" ON "songs"."id" = "playlists_songs"."song_id" WHERE "playlists_songs"."playlist_id" = $1  [["playlist_id", 1]]
---
  <tbody>
    <% @playlist.songs.each do |song| %>