ayudantias/asociaciones/app/controllers/albums_controller.rb

  def index
    @albums = Album.all
---
SELECT "albums".* FROM "albums"

  def create
    @album = Album.new(album_params)
    @album.artist = current_user.artist

    respond_to do |format|
      if @album.save
---
INSERT INTO "albums" ("title", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "disco 1"], ["created_at", "2020-05-08 07:50:15.883601"], ["updated_at", "2020-05-08 07:50:15.883601"], ["artist_id", 1]]

  def update
    respond_to do |format|
      if @album.update(album_params)
---
UPDATE "albums" SET "title" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["title", "holachaocomoestai"], ["updated_at", "2020-05-17 21:30:41.823627"], ["id", 3]]

  def destroy
    @album.destroy
---
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 1]]

    def set_album
      @album = Album.find(params[:id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]