ayudantias/asociaciones/app/controllers/artists_controller.rb

  def index
    @artists = Artist.all
---
SELECT "artists".* FROM "artists"

  def create
    @artist = Artist.new(artist_params)
    @artist.user = current_user

    respond_to do |format|
      if @artist.save
---
INSERT INTO "artists" ("band", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["band", "holaaaa"], ["created_at", "2020-05-08 07:41:10.605542"], ["updated_at", "2020-05-08 07:41:10.605542"], ["user_id", 1]]

  def update
    respond_to do |format|
      if @artist.update(artist_params)
---
UPDATE "artists" SET "band" = $1, "updated_at" = $2 WHERE "artists"."id" = $3  [["band", "asdasxd"], ["updated_at", "2020-05-17 21:20:11.978211"], ["id", 2]]

    def set_artist
      @artist = Artist.find(params[:id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]