ayudantias/asociaciones/app/controllers/playlists_controller.rb

  def index
    @playlists = Playlist.all
---
SELECT "playlists".* FROM "playlists"

  def create
    @playlist = Playlist.new(playlist_params)
    @playlist.user = current_user

    respond_to do |format|
      if @playlist.save
---
INSERT INTO "playlists" ("title", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "poto"], ["created_at", "2020-05-17 20:48:44.506984"], ["updated_at", "2020-05-17 20:48:44.506984"], ["user_id", 2]]

    def set_playlist
      @playlist = Playlist.find(params[:id])
---
SELECT  "playlists".* FROM "playlists" WHERE "playlists"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def load_songs
      @songs = Song.all
---
SELECT "songs".* FROM "songs"

    def find_song
      @song = Song.find(params[:song_id])
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]