ayudantias/asociaciones/app/controllers/songs_controller.rb

INSERT INTO "songs" ("title", "created_at", "updated_at", "album_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "gran cancion"], ["created_at", "2020-05-08 08:11:05.827698"], ["updated_at", "2020-05-08 08:11:05.827698"], ["album_id", 1]]
---
  def create
    @song = Song.new(song_params)
    @song.album = @album

    respond_to do |format|
      if @song.save

UPDATE "songs" SET "title" = $1, "updated_at" = $2 WHERE "songs"."id" = $3  [["title", "buenas noches"], ["updated_at", "2020-05-17 21:30:34.003854"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @song.update(song_params)

DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 3]]
---
  def destroy
    @song.destroy

SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_song
      @song = Song.find(params[:id])

SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_album
      @album = Album.find(params[:album_id])